{"pageProps":{"post":{"title":"Why dualboot ?","publishedAt":"2022-05-12","summary":"Motivation behind my choice of dualbooting Window 11 and Arch Linux.","image":"/images/linux-window-dualbool/banner.jpg","body":{"raw":"\n<Image\n  alt={`Dualboot with Encryption and Btrfs`}\n  src={`/images/linux-window-dualboot/banner.jpg`}\n  width={1280}\n  height={720}\n  priority\n/>\n\nA summary of why I choose to dual boot.\n\n### Why Window ?\n\n**Software**:\nAs a university student who use laptops as the primary mobile computing device, flexibility is the primary compass that guides my choice of operating systems and software. There are many specialized and niche applications that I used during my studies that are unfortunately only supported on Window. Although there has been efforts on porting Window application to Linux natively, or optimize the experience of Window programs through wine, some set of tasks, the overall hassle of tinkering and potential poorly performing application through Wine just does not seem to worth it and booting to Window seem to be a much easier path to choose.\n\n**Gaming**:\nThe gaming landscape on Linux had advanced greatly over the pass few years, notably with the development of Wine, Proton, DXVK, VKD3D,... that allow game across the spectrum to run on Linux, some with performance comparable or even better than on Window. However, the most popular games still crash on startup and unplayable due to the infamous anti cheat. In my case, League of Legends is one of those game unfortunately. Enjoying some occasional League games with my friends is the biggest reason why I keep a Window partition on my laptop.\n\n### Why Linux ?\n\n**Software**:\nBeside specialized software, modern Linux desktop environment are quite capable, handling a lot of everyday tasks such as checking email, browsing social media, reading news and editing documents near perfectly. Majority of modern desktop applications also have web-based versions that work identically to their native counterparts, thus one can use the browser for most of their work and the workflow would be more or less the same regardless of the underlying operating system.\n\nWeb development on Linux and in other Unix-based operating systems such as MacOS is also much more intuitive than on Window. The same commandline language are used in each step of development, from planing, scripting, to automating and finally deployment. As the majority of server nowadays runs Linux, having the same operating environment on your computer as the platform you are developing on definitely help familiarize and ease a lot of the tasks.\n\n**Security**:\nWith Window, there are a lot of constrains and barriers that stop users from doing what they want. Although some constraints are necessary to prevent users to not unintentional nuke there system, however, it is can be more restricting and inconvenient than secure. There are also the problem of data collection by Microsoft and the risk of future advertisement embedded in the system apps, which are of course factors, but are not the primary deal-breakers to me personally.\n\nAfter flexibility, security is another benchmark that I value in a computing system. With Linux, user gains a lot more control and flexibility to do whatever they want. All of the operating system's kernel are available for anyone to inspect and modify. Enterprise-level security features are coded into the kernel. Encryption, process isolation, namespace separation, etc are also available for user to enable if needed. Since a lot of large corporation utilize Linux for their network infrastructure, there are a lot of resources directed to improve the security of the Linux kernel, which desktop users can also benefit from.\n\n**Customization**:\nWith Linux, user can customize their desktop experience even to the minute details such as border, padding and color of individual UI elements. [r/unixporn](https://www.reddit.com/r/unixporn/) is an excellent subreddit that showcase the creativity and flexibility of a Linux desktop system. Poweruser can make their desktop optimized for keyboard-driven manipulation, fine tuning their workflow, and automating repetitive tasks. Minimalist can reduce clutter by remove unnecessary UIs, animation, eye candies and decorations. One can even compile their own personalized kernel and remove unnecessary features to improve boot time and snappiness.\n\n### Why dualboot ?\n\nI value practicality more any kind of philosophical ideologies that some Linux user might hold. So dualbooting to me has little to no downside. Managing two operating systems is not that complicated in practice. For Linux, setting up a cron timer to update once a week should be enough. For Window, security updates, which are at most 2-3 times per months, should always be prioritized over feature updates, which are more prone to vulnerabilities and exploits.\n\nFor now, Window is still needed for some of the software that my studies demand, but for the most part, Linux perfectly meet and even exceed my day-to-day requirements of a laptop operating systems. For most of my tasks, keyboard is all that I need and setting up a personalized keyboard-only workflow is only possible on Linux. Nowadays, Linux has been become my primary work OS and Window was only needed for occasional gaming and specialized software. Only time will tell whether Linux will gain mainstream adoption and overtake Window in term of software availability, which will also mark the time I finally transition to using Linux full time.\n\n<br />\n","code":"var Component=(()=>{var h=Object.create;var r=Object.defineProperty;var c=Object.getOwnPropertyDescriptor;var m=Object.getOwnPropertyNames;var u=Object.getPrototypeOf,p=Object.prototype.hasOwnProperty;var y=(t,o)=>()=>(o||t((o={exports:{}}).exports,o),o.exports),f=(t,o)=>{for(var i in o)r(t,i,{get:o[i],enumerable:!0})},s=(t,o,i,n)=>{if(o&&typeof o==\"object\"||typeof o==\"function\")for(let a of m(o))!p.call(t,a)&&a!==i&&r(t,a,{get:()=>o[a],enumerable:!(n=c(o,a))||n.enumerable});return t};var w=(t,o,i)=>(i=t!=null?h(u(t)):{},s(o||!t||!t.__esModule?r(i,\"default\",{value:t,enumerable:!0}):i,t)),g=t=>s(r({},\"__esModule\",{value:!0}),t);var d=y((j,l)=>{l.exports=_jsx_runtime});var L={};f(L,{default:()=>x,frontmatter:()=>b});var e=w(d()),b={title:\"Why dualboot ?\",publishedAt:\"2022-05-12\",summary:\"Motivation behind my choice of dualbooting Window 11 and Arch Linux.\",image:\"/images/linux-window-dualbool/banner.jpg\"};function v(t={}){let{wrapper:o}=t.components||{};return o?(0,e.jsx)(o,Object.assign({},t,{children:(0,e.jsx)(i,{})})):i();function i(){let n=Object.assign({p:\"p\",h3:\"h3\",a:\"a\",span:\"span\",strong:\"strong\"},t.components),{Image:a}=n;return a||k(\"Image\",!0),(0,e.jsxs)(e.Fragment,{children:[(0,e.jsx)(a,{alt:\"Dualboot with Encryption and Btrfs\",src:\"/images/linux-window-dualboot/banner.jpg\",width:1280,height:720,priority:!0}),`\n`,(0,e.jsx)(n.p,{children:\"A summary of why I choose to dual boot.\"}),`\n`,(0,e.jsxs)(n.h3,{id:\"why-window-\",children:[(0,e.jsx)(n.a,{className:\"anchor\",href:\"#why-window-\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"Why Window ?\"]}),`\n`,(0,e.jsxs)(n.p,{children:[(0,e.jsx)(n.strong,{children:\"Software\"}),`:\nAs a university student who use laptops as the primary mobile computing device, flexibility is the primary compass that guides my choice of operating systems and software. There are many specialized and niche applications that I used during my studies that are unfortunately only supported on Window. Although there has been efforts on porting Window application to Linux natively, or optimize the experience of Window programs through wine, some set of tasks, the overall hassle of tinkering and potential poorly performing application through Wine just does not seem to worth it and booting to Window seem to be a much easier path to choose.`]}),`\n`,(0,e.jsxs)(n.p,{children:[(0,e.jsx)(n.strong,{children:\"Gaming\"}),`:\nThe gaming landscape on Linux had advanced greatly over the pass few years, notably with the development of Wine, Proton, DXVK, VKD3D,... that allow game across the spectrum to run on Linux, some with performance comparable or even better than on Window. However, the most popular games still crash on startup and unplayable due to the infamous anti cheat. In my case, League of Legends is one of those game unfortunately. Enjoying some occasional League games with my friends is the biggest reason why I keep a Window partition on my laptop.`]}),`\n`,(0,e.jsxs)(n.h3,{id:\"why-linux-\",children:[(0,e.jsx)(n.a,{className:\"anchor\",href:\"#why-linux-\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"Why Linux ?\"]}),`\n`,(0,e.jsxs)(n.p,{children:[(0,e.jsx)(n.strong,{children:\"Software\"}),`:\nBeside specialized software, modern Linux desktop environment are quite capable, handling a lot of everyday tasks such as checking email, browsing social media, reading news and editing documents near perfectly. Majority of modern desktop applications also have web-based versions that work identically to their native counterparts, thus one can use the browser for most of their work and the workflow would be more or less the same regardless of the underlying operating system.`]}),`\n`,(0,e.jsx)(n.p,{children:\"Web development on Linux and in other Unix-based operating systems such as MacOS is also much more intuitive than on Window. The same commandline language are used in each step of development, from planing, scripting, to automating and finally deployment. As the majority of server nowadays runs Linux, having the same operating environment on your computer as the platform you are developing on definitely help familiarize and ease a lot of the tasks.\"}),`\n`,(0,e.jsxs)(n.p,{children:[(0,e.jsx)(n.strong,{children:\"Security\"}),`:\nWith Window, there are a lot of constrains and barriers that stop users from doing what they want. Although some constraints are necessary to prevent users to not unintentional nuke there system, however, it is can be more restricting and inconvenient than secure. There are also the problem of data collection by Microsoft and the risk of future advertisement embedded in the system apps, which are of course factors, but are not the primary deal-breakers to me personally.`]}),`\n`,(0,e.jsx)(n.p,{children:\"After flexibility, security is another benchmark that I value in a computing system. With Linux, user gains a lot more control and flexibility to do whatever they want. All of the operating system's kernel are available for anyone to inspect and modify. Enterprise-level security features are coded into the kernel. Encryption, process isolation, namespace separation, etc are also available for user to enable if needed. Since a lot of large corporation utilize Linux for their network infrastructure, there are a lot of resources directed to improve the security of the Linux kernel, which desktop users can also benefit from.\"}),`\n`,(0,e.jsxs)(n.p,{children:[(0,e.jsx)(n.strong,{children:\"Customization\"}),`:\nWith Linux, user can customize their desktop experience even to the minute details such as border, padding and color of individual UI elements. `,(0,e.jsx)(n.a,{href:\"https://www.reddit.com/r/unixporn/\",children:\"r/unixporn\"}),\" is an excellent subreddit that showcase the creativity and flexibility of a Linux desktop system. Poweruser can make their desktop optimized for keyboard-driven manipulation, fine tuning their workflow, and automating repetitive tasks. Minimalist can reduce clutter by remove unnecessary UIs, animation, eye candies and decorations. One can even compile their own personalized kernel and remove unnecessary features to improve boot time and snappiness.\"]}),`\n`,(0,e.jsxs)(n.h3,{id:\"why-dualboot-\",children:[(0,e.jsx)(n.a,{className:\"anchor\",href:\"#why-dualboot-\",children:(0,e.jsx)(n.span,{className:\"icon icon-link\"})}),\"Why dualboot ?\"]}),`\n`,(0,e.jsx)(n.p,{children:\"I value practicality more any kind of philosophical ideologies that some Linux user might hold. So dualbooting to me has little to no downside. Managing two operating systems is not that complicated in practice. For Linux, setting up a cron timer to update once a week should be enough. For Window, security updates, which are at most 2-3 times per months, should always be prioritized over feature updates, which are more prone to vulnerabilities and exploits.\"}),`\n`,(0,e.jsx)(n.p,{children:\"For now, Window is still needed for some of the software that my studies demand, but for the most part, Linux perfectly meet and even exceed my day-to-day requirements of a laptop operating systems. For most of my tasks, keyboard is all that I need and setting up a personalized keyboard-only workflow is only possible on Linux. Nowadays, Linux has been become my primary work OS and Window was only needed for occasional gaming and specialized software. Only time will tell whether Linux will gain mainstream adoption and overtake Window in term of software availability, which will also mark the time I finally transition to using Linux full time.\"}),`\n`,(0,e.jsx)(\"br\",{})]})}}var x=v;function k(t,o){throw new Error(\"Expected \"+(o?\"component\":\"object\")+\" `\"+t+\"` to be defined: you likely forgot to import, pass, or provide it.\")}return g(L);})();\n;return Component;"},"_id":"blog/linux-windown-dualboot.mdx","_raw":{"sourceFilePath":"blog/linux-windown-dualboot.mdx","sourceFileName":"linux-windown-dualboot.mdx","sourceFileDir":"blog","contentType":"mdx","flattenedPath":"blog/linux-windown-dualboot"},"type":"Blog","readingTime":{"text":"5 min read","minutes":4.15,"time":249000,"words":830},"wordCount":832,"tweetIds":[],"slug":"linux-windown-dualboot"}},"__N_SSG":true}